tutorials/potentialFoam/pitzDaily/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/dm2/henry/OpenFOAM/OpenFOAM-1.4.1/tutorials/potentialFoam";
    case "pitzDaily";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
inlet
{
    type patch;
    physicalType inlet;
    nFaces 30;
    startFace 24170;
}

outlet
{
    type patch;
    physicalType outlet;
    nFaces 57;
    startFace 24200;
}

upperWall
{
    type wall;
    physicalType wall;
    nFaces 223;
    startFace 24257;
}

lowerWall
{
    type wall;
    physicalType wall;
    nFaces 250;
    startFace 24480;
}

frontAndBack
{
    type empty;
    physicalType empty;
    nFaces 24450;
    startFace 24730;
}
)

// ************************************************************************* //
